{
  "_name_or_path": "bert-base-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-ACTION",
    "1": "I-ACTION",
    "2": "O",
    "3": "B-PARAMETER",
    "4": "I-PARAMETER",
    "5": "B-STATE",
    "6": "I-STATE",
    "7": "B-COMPONENT",
    "8": "B-ISSUE",
    "9": "I-ISSUE",
    "10": "B-FUNCTION",
    "11": "I-FUNCTION",
    "12": "I-COMPONENT"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACTION": 0,
    "B-COMPONENT": 7,
    "B-FUNCTION": 10,
    "B-ISSUE": 8,
    "B-PARAMETER": 3,
    "B-STATE": 5,
    "I-ACTION": 1,
    "I-COMPONENT": 12,
    "I-FUNCTION": 11,
    "I-ISSUE": 9,
    "I-PARAMETER": 4,
    "I-STATE": 6,
    "O": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.24.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
